APICJunit/RequestMessages/RequestMessage1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:exam="http://Example.org">
   <soapenv:Header/>
   <soapenv:Body>
      <exam:Subtract>
         <!--Optional:-->
         <exam:a>100</exam:a>
         <!--Optional:-->
         <exam:b>10</exam:b>
      </exam:Subtract>
   </soapenv:Body>
</soapenv:Envelope><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webserviceX.NET"><SOAP-ENV:Header/><SOAP-ENV:Body><web:GetCitiesByCountry><web:CountryName>India</web:CountryName></web:GetCitiesByCountry></SOAP-ENV:Body></SOAP-ENV:Envelope>